// Global variables
const clickSound = new Audio("الوسائط/الأصواط/انقر.wav");
const falseSound = new Audio("الوسائط/الأصواط/خطأ.wav");
const trueSound = new Audio("الوسائط/الأصواط/صحيح.wav");
const mainScreen = document.getElementById('main-container');
const loginScreen = document.getElementById('auth');
const authHeader = document.getElementById('auth-header');
// Variables for DOM elements
//main Elements
const main = document.getElementById("main");



// Level 1 Elements
const level1 = document.getElementById("level_1");
const level1Container = document.getElementById("chapters_lvl_1_container");
let isLevel1ChaptersRendered = false;


level1.addEventListener("click", () => {
    clickSound.play();
    isLevel1ChaptersRendered = !isLevel1ChaptersRendered;
    if (isLevel1ChaptersRendered) {
        level1Container.innerHTML =   
           `<div id="level_1_chapter_1" class="chapters" onclick="level1Chapter1Content()">مقدمة للأرقام</div>
            <div id="level_1_chapter_2" class="chapters" onclick="main.innerHTML = level1Chapter2Content()">مقارنة الأرقام</div>
            <div id="level_1_chapter_3" class="chapters" onclick="main.innerHTML = level1Chapter3Content()"> كتابة الأرقام بالحروف</div>
            <div id="level_1_chapter_4" class="chapters" onclick="main.innerHTML = level1Chapter4Content()"> القيم المكانية والقيم</div>
            <div id="level_1_chapter_4" class="chapters" onclick="main.innerHTML = level1Chapter5Content()">مراجعة و الامتحان</div>
            `;

    } else {
        level1Container.innerHTML = 
           ``;
    }
});



// end of Level 2 Elements
// Content functions 
// level 1 below
function level1Chapter1Content(){
    clickSound.play();
    return main.innerHTML = `<h1 class="chapter-headers">مقدمة للأرقام</h1>
       <hr>
       <br>
       <br>
       
       <img src="الوسائط/الصور/1-10.png" class="large-img">
       <h5>هل لاحظت شيئا؟</h5>
       <p><span class="important">1</span>: رقم, <span class="important">2</span>: رقم, <span class="important">3</span>: رقم,</p>
       <p><span class="important">أرفام: 1 2 3 4 5 6 7 8 9</span></p>
       <p><b>استنتاج</b>: أي شيء من: 1 2 3 4 5 6 7 8 9 0، هو رقم</p><br><br><br>
       <br><img src="الوسائط/الصور/أحجام الأرقام.jpg" class="large-img">
       <p>الأرقام لديها <span class="important">كمية</span> <b>كما في الصورة التالية</b></p>
       <h3><span class="important">الكمية:</span></h3><p>يعني تستخدمها <span class="important"> لعد</span>أي شيء
    </p>
    
    <p>مثال:<br><br> 5 كرات<br> 4 تفاحات<br> 3 بيتزا<br> 2 سحابة (سحابتان)<br> 1 قرن مسلجات</p>
    <img src="الوسائط/الصور/كمية الرقم.jpg" class="large-img">
    <h3>لاحظ ما يلي:</h3><br>
    
    <p>كما ترون فإن الرقم يمثل كمية الأشياء</p>
    <p>لذا، إذا كان لدي <span class="important">3</span> تفاحات، فهذا يعني أن لدي <span class="important">3</span> منها</p>
    <p>مثل هذا:<br><br>🍎🍎🍎</p>
    <p>أنت تعرف العلامة "<span class="important">=</span>" والتي تعني "<span class="important">متساوي</span>"</p>
    <p>الآن سوف نمثل الأرقام بO:<br>1 = O<br>2 = OO<br>3 = OOO<br>4 = OOOO<br>5 = OOOOO
        <br>6 = OOOOOO<br>7 = OOOOOOO<br>8 = OOOOOOOO <br>9 = OOOOOOOOO<br>10 = OOOOOOOOOO</p>
        <p>الآن دورك</p><br>
        <h3>قم بتمثيل الأعداد التالية بـO:</h3>
        <div class="question-machine-1">
            <span class="result" id="result-1"></span><br> قم بتمثيل<span id="question-1" class="important">1</span> في المربع التالي<br>
            <button class="check-btn-1" onclick="checkAnswer1()">تحقق من الإجابة</button>
            <input type="text" class="user-input-1" id="answer-input-1" placeholder="اكتب اجابتك هنا" maxlength="10">

        </div>`;
}


function level1Chapter2Content(){
    clickSound.play();
    return `        <h1 class="chapter-headers">مقارنة الأرقام</h1>
        <hr>
        <br><br>
        <img src="الوسائط/الصور/أحجام الأرقام.jpg" alt="أحجام الأرقام" class="large-img">
        <p>هل تتذكر هذا؟</p>
        <p>عند مقارنة الأرقام، يمكننا استخدام الرموز<span class="important">&lt;</span> (أقل من), <br><span class="important">&gt;</span> (أكثر من), and <span class="important">=</span> (يساوي) لإظهار العلاقة بين رقمين.</p>
        <p>على سبيل المثال، إذا كان لدينا الرقمان 3 و 5، <br>فيمكننا القول:</p>
        <ul>
            <li>3 &lt; 5 (3 اقل من 5)</li>
            <li>5 &gt; 3 (5 أكثر من 3)</li>
            <li>3 = 3 (3 نساوي 3)</li>
        </ul>
        <p>عند مقارنة الأعداد، يمكننا أيضًا استخدام خط الأعداد لتصور مواقعها. العدد الموجود على اليسار دائمًا أصغر من العدد الموجود على اليمين.</p>
        <img src="الوسائط/الصور/خط الأعداد.jpg" alt="خط الأعداد" class="large-img">
        <p>على سبيل المثال، على خط الأعداد:</p>
        <ul>
            <li>العدد 2 يقع على يسار العدد 4، لذا 2&lt; 4</li>
            <li>العدد 6 يقع على يمين العدد 3، لذا 6 &gt; 3</li>
            <li>العدد 5 يقع في نفس موضع العدد 5، لذا فإن 5 = 5</li>
        </ul>
        <p>تساعدنا مقارنة الأرقام على فهم علاقاتها واتخاذ القرارات<br> بناءً على قيمها.</p>
        <p>على سبيل المثال، إذا أردنا معرفة أي رقم أكبر، <br>فيمكننا مقارنتهما باستخدام الرموز &lt;, &gt;, و =.</p>
        <p>باختصار، تُعد مقارنة الأرقام وسيلة لفهم علاقاتها واتخاذ القرارات بناءً على قيمها. يمكننا استخدام رموز مثل &lt;, &gt;, و = لإظهار كيفية ارتباط رقمين ببعضهما البعض.</p>
        <p>والآن، دعونا نتدرب على مقارنة الأرقام من خلال بعض الأمثلة:</p>
        <ul>
            <li>هل 7 &lt; 10?</li>
            <li>هل 12 &gt; 8?</li>
            <li>هل 5 = 5?</li>
            <li>هل 3 &lt; 2?</li>
            <li>هل 9 &gt; 11?</li>
            <li>هل 4 = 4?</li>
        </ul>
        <p>الاجابات:</p>
        <ul>
            <li>صحيح✔, 7 &lt; 10</li>
            <li>صحيح✔, 12 &gt; 8</li>
            <li>صحيح✔, 5 = 5</li>
            <li>خطأ❌, 3 ليس أكبر من 2</li>
            <li>خطأ❌, 9 ليس أكبر من 11</li>
            <li>صحيح✔, 4 = 4</li>
        </ul>
        <p>أحسنت! لقد تعلمت كيفية مقارنة الأرقام باستخدام الرموز &lt;, &gt;, و =. استمر في التدريب، وستصبح أفضل في مقارنة الأرقام!</p>
        <p>الأن دورك</p>
        <p><span class="important">لكن انتظر</span>قبل أن تحاول، تأكد من معرفة كيفية المقارنة بين الأرقام المكونة من رقمين.</p>
        <img src="الوسائط/الصور/قارن بين الأرقام المكونة من رقمين.jpg" alt="قارن بين الأرقام المكونة من رقمين" class="large-img">
        <p>عند مقارنة الأعداد المكونة من رقمين، نبدأ بالنظر إلى <br>خانة العشرات (الرقم الأول من اليسار). العدد الذي <br>يحتوي على رقم أكبر في خانة العشرات هو العدد الأكبر.<br> إذا تساوى الرقمان في خانة العشرات،<br> نقارن بعد ذلك الرقمين في خانة الآحاد <br>(الرقم الثاني من اليسار).</p>
        <p>علي سبيل المثال:</p>
        <ul>
            <li>قارن بين 34 و 56: خانة العشرات هي 3 و 5<br>. بما أن 5 أكبر من 3، فإن الناتج هو 34&lt; 56.</li>
            <li>قارن بين 78 و72: رقم العشرات في كليهما هو 7. ثم نقارن رقم الآحاد، وهما 8 و2<br>. بما أن 8 أكبر من 2، فإن الناتج هو 78 &gt; 72.</li>
            <li>قارن بين 45 و45: خانة العشرات وخانة الآحاد متطابقتان، لذا لدينا 45 = 45.</li>
        </ul>
        <p>الآن دورك حقاً</p>
        <div class="question-machine-1">
            <p id = "result2">قارن بين هذه الأرقام والرمز الصحيح</p>
                <span id="question-machine-2-number-1">4</span>
                <button class="compare-symbol" onclick="compare('>')">&gt</button>
                <button class="compare-symbol" onclick="compare('=')">=</button>
                <button class="compare-symbol" onclick="compare('<')">&lt</button>
                <span id="question-machine-2-number-2">2</span>
        </div>`;
}


function level1Chapter3Content(){
    clickSound.play();
    return `<h1 class="chapter-headers">تهجئة الأرقام بالحروف</h1>
        <hr>
        <ul class="large-font">
<li>1 واحد</li> 
<li>2 اثنان</li> 
<li>3 ثلاثة</li> 
<li>4 أربعة</li> 
<li>5 خمسة</li> 
<li>6 ستة</li> 
<li>7 سبعة</li> 
<li>8 ثمانية</li> 
<li>9 تسعة</li> 
<li>10 عشرة</li> 
<li>11 أحد عشر</li> 
<li>12 اثنا عشر</li> 
<li>13 ثلاثة عشر</li> 
<li>14 أربعة عشر</li> 
<li>15 خمسة عشر</li> 
<li>16 ستة عشر</li> 
<li>17 سبعة عشر</li> 
<li>18 ثمانية عشر</li> 
<li>19 تسعة عشر</li> 
<li>20 عشرون</li> 
<li>21 واحد وعشرون</li> 
<li>22 اثنان وعشرون</li> 
<li>30 ثلاثون</li> 
<li>40 أربعون</li> 
<li>50 وخمسون</li> 
<li>60 ستون</li> 
<li>70 سبعون</li> 
<li>80 ثمانون</li> 
<li>90 تسعون</li> 
<li>100 مائة</li>
<li>200 مئتان</li> 
<li>1000 ألف</li>
        </ul>
       <p><span class="important">هذا كل ما</span> تحتاج لمعرفته لتتمكن من كتابة الأرقام حتى الألف بالأحرف العربية</p>
        <p>يبدو هذا صعباً، لكن عقلك <span class="important"> أصعب</span></p>
        <p>كل ما عليك فعله هو التحلي بالصبر</p>
        <p>لكن يمكنك الاطلاع عليها متى احتجت إليها</p>
        <p>فلنبدأ إذاً</p>
        <p>إذا كان علينا أن نتهجى<span class="important">45</span></p>
        <ul class=>
            <li>سنلقي نظرة على العشرات أولاً</li>
            <li>40 هي أربعون</li>
            <li>ثم ننظر إلى الاحاد <span class="important">(الرقم الأول من اليمين وهو 5 )</span></li>
            <li>5 هي خمسة</li>
            <li>لذلك قمنا بجمعهم معًا</li>
            <li>خمسة وأربعون</li>
        </ul>
        <p>لنجرب واحدة أخرى</p>
        <p>إذا كان علينا أن نتهجى<span class="important">213</span></p>
        <ul>
            <li>ننظر إلى المئات أولاً<span class="important">(الرقم الثالث من اليمين وهو 2، ثم نضع أصفارًا)</span></li>
            <li>200 مئتان</li>
            <li>ثم ننظر الي العشرات (الرقم الثاني من اليميين و هو 1)</li>
            <li>10 هي عشرة</li>
            <li>ثم ننظر الي الاحاد (الرقم الاول من اليميين و هو 3)</li>
            <li>3 هي ثلاثة</li>
            <li>ثم نضعهم معن</li>
            <li>مئتان و ثلاثة عشر</li>
        </ul>
        <p>يمكنك فعلها!</p>
        <p>مثال آخر: 451</p>
        <ul>
            <li>ننظر علي المئات</li>
            <li>400 أربعمائة</li>
            <li>ثم ننظر للعشرات (الرقم الثاني من اليمين وهو 5)</li>
            <li>50 خمسون</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 1)</li>
            <li>1 هو واحد</li>
            <li>لذلك قمنا بجمعهم معًا</li>
            <li>أربعمائة وواحد وخمسون</li>
        </ul>
        <p>مثال آخر:999</p>
        <ul>
            <li>ننظر إلى المئات أولاً</li>
            <li>900 تعني تسعمائة</li>
            <li>ثم ننظر إلى خانة العشرات (الرقم الثاني من اليمين وهو 9).</li>
            <li>90 هو تسعون</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 9)</li>
            <li>9 هو تسعة</li>
            <li>ثم نجمعهم معً</li>
            <li>تسعمائة وتسعة وتسعون</li>
        </ul>
        <p>مثال آخر: 073</p>
        <ul>
            <li>ننظر إلى المئات أولاً</li>
            <li><span class="important">الصفر  0 لا يمثل شيئًا، لذا نتجاهله، يجب عليك البحث عن الرقم الموجود في أقصى اليمين والذي يساوي 1 أو أكثر(0 &lt; رقم)</span></li>
            <li>ثم ننظر إلى خانة العشرات (الرقم الثاني من اليمين وهو 7).</li>
            <li>70 سبعون</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 3)</li>
            <li>3ثلاثة</li>
            <li>ثم نجمعهم معًا </li>
            <li>ثلاثة وسبعون</li>
        </ul>
        <p>لقد فعلتها!</p>
        <img alt="أحجام الأرقام 2" src="الوسائط/الصور/أحجام الأرقام 2.jpg" class="large-img right-aligned-img">
        <p>الآن سنبذل جهدًا أكبر</p>
        <p>مثال آخر:<span class="important">1201</span></p>
        <ul>
            <li>ننظر إلى الآلاف أولاً <span class="important">(الرقم الرابع من اليمين وهو<br> 1 ثم نضع ثلاثة أصفار</span></li>
            <li>1000 ألف</li>
            <li>ثم ننظر إلى المئات (الرقم الثالث من اليمين وهو 2)</li>
            <li>200 هو مائتان</li>
            <li>ثم ننظر إلى العشرات (الرقم الثاني من اليمين وهو 0)</li>
            <li><span class="important">0 لا شيء لذا نتخطى ذلك، يجب أن تنظر إلى الرقم الموجود في أقصى اليمين وهو 1 أو أكثر(0 &lt; رقم)</span></li>
            <li>ثم ننظر إلى الوحدات (الرقم الأول من اليمين وهو 1)</li>
            <li>1 هو واحد</li>
            <li>ثم نضعهم معن</li>
            <li><span class="important">ألف ومائتان وواحد</span></li>
        </ul>
        <span class="important">نفصل ب"و" بين كل رقم</span>
        <p>مثال آخر:<span class="important">3050</span></p>
        
        <ul>
            <li>ننظر إلى الآلاف أولاً<span class="important">(الرقم الرابع من اليمين وهو 3، ثم نضع ثلاثة أصفار)</span></li>
            <li>3000 تعني ثلاثة آلاف</li>
            <li>ثم ننظر إلى خانة المئات (الرقم الثالث من اليمين وهو 0).</li>
            <li><span class="important">الصفر لا يمثل شيئًا، لذا نتجاهله، يجب عليك البحث عن الرقم الموجود في أقصى اليمين والذي يساوي 1 أو أكثر(0 &lt; رقم)</span></li>
            <li>ثم ننظر إلى خانة العشرات (الرقم الثاني من اليمين وهو 5).</li>
            <li>50 خمسون</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 0)</li>
            <li><span class="important">الصفر لا يمثل شيئًا، لذا نتجاهله، يجب عليك البحث عن الرقم الموجود في أقصى اليمين والذي يساوي 1 أو أكثر(0 &lt; رقم)</span></li>
            <li>ثم نجمعهم معن</li>
            <li><span class="important">ثلاثة آلاف وخمسون</span></li>
        </ul>
        <span class="important">اذا كنت لا تعرف متي تضع خمسين أو خمسون , ثلاثة أو ثلاث ; فهاذا الدرس ستأخذه في اللغة العربية أن شاء الله في اللغة العربية ,يمكنك البحث عن "تمييز الأعداد" علي الأنترنت  </span>
        <p>مثال آخر:<span class="important">4915</span></p>
        <ul>
            <li>ننظر إلى الآلاف أولاً<span class="important">(الرقم الرابع من اليمين وهو 4، ثم نضع ثلاثة أصفار)</span></li>
            <li>4000 أربعة آلاف</li>
            <li>ثم ننظر إلى المئات (الرقم الثالث من اليمين وهو 9)</li>
            <li>900 تسعمائة</li>
            <li>ثم ننظر إلى خانة العشرات (الرقم الثاني من اليمين وهو 1).</li>
            <li>10 is Ten</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 5)</li>
            <li>5 خمسة</li>
            <li>ثم نجمعهم معن</li>
            <li><span class="important">أربعة آلاف وتسعمائة وخمسة عشر</span></li>
        </ul>
        <span class="important">في تسعمائة, انت تحذف التاء المربوتة لكي يتم الربط بين تسعة و مائة(تسعة ==&gt; تسع) و كذلك في ثمانية8 تحذف منها (ية)</span>
        <p>
        <span class="important">ملاحظة: يُستخدم رمز الألف مع الأعداد التي تحتوي على 000 (باستثناء الصفر) مثل 1000، 2000، 3000، 4000، 5000، 6000.
7000، 8000، 9000، يُكتب العدد كما هو موضح في: 3000 (ثلاثة آلاف) و8000 (ثمانية آلاف).</span>
        </p>
        <p>مثال آخر:<span class="important">9999</span></p>
        <ul>
            <li>ننظر إلى الآلاف أولاً<span class="important">(الرقم الرابع من اليمين وهو 9، ثم نضع ثلاثة أصفار)</span></li>
            <li>9000 تسعة آلاف</li>
            <li>ثم ننظر إلى المئات (الرقم الثالث من اليمين وهو 9)</li>
            <li>900 تعني تسعمائة</li>
            <li>ثم ننظر إلى خانة العشرات (الرقم الثاني من اليمين وهو 9).</li>
            <li>90 هو تسعون</li>
            <li>ثم ننظر إلى الآحاد (الرقم الأول من اليمين وهو 9)</li>
            <li>9 تسعة</li>
            <li>ثم نجمعهم معن</li>
            <li><span class="important">تسعة آلاف وتسعمائة وتسعة وتسعون</span></li>
        </ul>
        <p>والآن دورك، ولأول مرة ستستخدم الورقة والقلم (أو قلم الرصاص) للحل</p>
        <img src="الوسائط/الصور/ورقة و قلم.jpg" alt="ورقة و قلم" class="large-img left-aligned-img">
        <p>حاول تهجئة هذه الأرقام:</p>
        <ul class="large-font">
            <li>2567</li>
            <li>543401</li>
            <li>54790</li>
            <li>423</li>
            <li>6054</li>
        </ul>
        <span class="important">لا تقلق ليس عليك الدقة في الاملاء كثيرا<br> و لكن ربما لا تحملها</span>
        <span class="important">تجاهل هذه ان لم تفهمها</span>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الأول: 2567</summary>
            <p>ألفان وخمسمئة وسبعة وستون</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثاني: 543401</summary>
            <p>خمسمائة وثلاثة وأربعون ألفاً وأربعمائة وواحد</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثالث: 54790</summary>
            <p>أربعة وخمسون ألفاً وسبعمائة وتسعون</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الرابع: 423</summary>
            <p>أربعمائة وثلاثة وعشرون</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الخامس: 6054</summary>
            <p>ستة آلاف وأربعة وخمسون</p>
        </details>
        <span class="important">قيم نفسك!! 😂</span>
        <p>تحديات أخرى</p>
        <p>حاول تهجئة هذه الأرقام:</p>
        <ul class="large-font">
            <li>7896</li>
            <li>12005</li>
            <li>430210</li>
            <li>905</li>
            <li>100000</li>
        </ul>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الأول: 7896</summary>
            <p>سبعة آلاف وثمانمائة وستة وتسعون</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثاني: 12005</summary>
            <p>اثنا عشر ألفاً وخمسة</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثالث: 430210</summary>
            <p>أربعمائة وثلاثون ألفاً ومائتان وعشرة</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الرابع: 905</summary>
            <p>تسعمائة وخمسة</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الخامس: 100000</summary>
            <p>مئة ألف</p>
        </details>
        <p>الواجب المنزلي: حاول البحث عن هذه المواضيع على الإنترنت أو أي مصدر آخر.
            <span class="important">"كيفية تهجئة أرقام المليون"</span>ثم قم بحل هذه المسائل:</p>
        <ul class="large-font">
            <li>1,234,567</li>
            <li>5,600,000</li>
            <li>23,450,789</li>
        </ul>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الأول: 1,234,567</summary>
            <p>مليون ومائتان وأربعة وثلاثون ألفاً وخمسمئة وسبعة وستون</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثاني: 5,600,000</summary>
            <p>خمسة ملايين وستمائة ألف</p>
        </details>
        <details>
            <summary>انقر هنا لعرض إجابة السؤال الثالث: 23,450,789</summary>
            <p>ثلاثة وعشرون مليوناً وأربعمائة وخمسون ألفاً وسبعمائة وتسعة وثمانون</p>
            <span class="important">أصعب سؤال في الدرس</span>
        </details>
        <h2>أعلم أن هذا الدرس قد يستغرق شهرًا لإتمامه،
لكن لا شيء يأتي بسهولة، فإذا فهمت هذه المعلومات بسرعة
فستكون فخورًا جدًا بنفسك، فلكي تتعلم الرياضيات عليك .
        <span class="important">❌حفظ كل شيء</span>, ✔<span class="important">الفهم والملاحظة والبحث</span></h2>
        <p>نراكم في الفصل القادم، تهانينا🏆</p>`;
}


function level1Chapter4Content(){
    clickSound.play();
    return `           <h1 class="chapter-headers">القيم العددية و أسماء الخانات</h1>
            <hr>
            <h4>سيكون هذا الدرس سهلًا جدًا <span class="important">إن عرفت ما كان في الفصل الثالث</span>, علي أي حال هيا نعرف ما الذي هنا😄</h4>
            <p>إذا كان لدينا <span class="important">235412</span> وقلت لك <span class="important">"ما هي قيمة 5 و ما القيمة المكناية "</span> 
            فستستخرج 5 وتضع أصفارًا مكان 412 فستكون <span class="important">"5000"</span> وهذه هي القيمة أما القيمة المكانية تكون <span class="important">"الآلاف"</span>
        </p>
        <h3>إن فهمت الفكرة فلا تكمل الدرس بل حل الأسئلة</h3>
        <p>ليس عليك قراءة كل شيء, فقط عليك أن تلاحظ و تستنتج الفكرة</p>
        <img src="الوسائط/الصور/القيم.jpg" alt="القيم العددية و أسماء الخانات" class="large-img">
        <p>عرفت الفكرة, لاحظ السئلة</p>
        <p>علي أي حال, اسماء الخانات هي القيمة المكانية</p>
        <h3>استخرج:</h3>
        <ul>
            <li>القيمة المكانية ل 2 في 644521</li>
            <li>قيمة 6 في 634342</li>
            <li>قيمة 9 في 549</li>
            <li>القيمة المكانية  ل5 في 75897</li>
            <li>قيمة 3 في 3</li>
        </ul>
        <p>هل هذا سهل, آمل ذلك😂</p>
        <p>سأقول لك الإجابة, بعض أن تحاول حلها🤣</p>
        <details>
            <summary>إجابة سؤال واحد</summary>
            <span class="important">العشرات</span>
        </details>
        <details>
            <summary>إجابة سؤال اثنين</summary>
            <span class="important">600000</span>
        </details>
        <details>
            <summary>إجابة سؤال ثلاثة</summary>
            <span class="important">9</span>
        </details>
        <details>
            <summary>إجابة سؤال أربعة</summary>
            <span class="important">الآلاف</span>
        </details>
        <details>
            <summary>إجابة سؤال خمسة</summary>
            <span class="important">3</span> 😅 إذا جبتها , هذا يعني انك عبقري
        </details>
        <p>هذا هو كل ما في الفصل</p>
        <p>الآن حل و اختبر نفسك</p>
        <div class="question-machine-1">
            <p id = "result4">استخرج قيمة لهذا الرقم</p>
            <span class="important" id="question-4-2">5</span>
            <p>في</p>
            <span class="important" id="question-4">6544</span><br>
                <button class="question-machine-4-btn" id="question-machine-4-btn-1" onclick="answerQuestion4(0)">5</button>
                <button class="question-machine-4-btn" id="question-machine-4-btn-2" onclick="answerQuestion4(1)">50</button>
                <button class="question-machine-4-btn" id="question-machine-4-btn-3" onclick="answerQuestion4(2)">500</button>
                <button class="question-machine-4-btn" id="question-machine-4-btn-4" onclick="answerQuestion4(3)">5000</button>
                <button class="question-machine-4-btn" id="question-machine-4-btn-5" onclick="answerQuestion4(4)">50000</button>
                <button class="question-machine-4-btn" id="question-machine-4-btn-6" onclick="answerQuestion4(5)">500000</button>
        </div>`;
}
function level1Chapter5Content(){
    clickSound.play();
    return `<h1 class="chapter-headers">المراجعة و الامتحان</h1>
        <hr>
        
        <img src="https://raw.githubusercontent.com/DeathBringer2009/-/main/الصور/مراجعة الأعداد.jpg" alt="مراجعة الأعداد" class="large-img">
        <h3>هل تتذكر الأرقام؟</h3>
        <p>حقا؟ أنا لا أصدقك😢</p>
        <p>الأرقام هي اي شيء مكون من 1 2 3 4 5 6 7 8 9</p>
        <p>تذكرت؟</p>
        <p>الأرقام تستخدمها لعد أي شيء <span class="important">هناك أشياء لا <br>تعد مثل اللبن و الماء و أي شيء مثل هذا</span></p>
        <p>هل تتذكر كيف تقارن بين رقمين</p>
        <img src="https://raw.githubusercontent.com/DeathBringer2009/-/main/الصور/مقارنة الحلوة.jpg" alt="اختيار الحلوة" class="large-img">
        <span class="important">&gt;,&lt;,=</span>
        <p>أي رقم مثل أي رقم تستخدم <span class="important">=</span></p>
        <p>أما <span class="important">&gt;,&lt;</span> يفتحوا فمهم علي من أكبر</p>
        <p>مثال: 5 &gt; 3 (خمسة أكبر من ثلاثة)</p>
        <p>فإذا كان لديك طبق حلوة و حلوة فماذا ستختار؟</p>
        <p>فهذا التمساح أقصد هذه العلامة <span class="important">&gt;</span> تأكل ما تريد مثلك</p>
        <p>فخمن ماذا سيختار؟</p>
        <p>أنا اعرف أنك ذكي, هيا نحل بعض الأمثلة</p>
        <ul>
            <li>856___765</li>
            <li>532___543</li>
            <li>123___128</li>
        </ul>
        <details>
            <summary>الحلول</summary>
            <ul>
                <li>856 &gt; 765</li>
                <li>532 &lt; 543</li>
                <li>123 &lt; 128</li>
            </ul>
        </details>
        <p>مثال:4543 هل تتذكر كيف تكتب الأرقام بالحروف؟</p>
        <img src="الوسائط/الصور/مراجعة كتابة الأرقام.jpg" alt="كيف تكتب الأرقام بالحروف" class="large-img">
        <p>هل تتذكر؟</p>
        <p>تقسم الأرقام إلي جزءين  |543|و|4| </p>
        <p>الجزء الأول 543 هو المئات و العشرات و الآحاد</p>
        <p>نفس الفكرة, مئات و عشرات و الآحاد <span class="important">لكن</span><br> تضيف آلاف إن كان رقم واحد<br>
        <span class="important">آحاد فقط</span> إن كان فيه مئات أو عشرات تضع ألف</p>
        <p>ف أربعة نضيف ألآف فتصبح <span class="important">أربعة آلاف</span></p>
        <p>و 543 تكتب خمسمائة و ثلاثة و أربعون</p>
        <p>ف 4543 تكتب <span class="important">أربعة آلاف و خمسمائة و ثلاثة و أربعون</span></p>
        <h4>مثال آخر: 543676</h4>
        <p>تقسم الرقم إلي |676| و |543|</p>
        <p>ثم 543 يصبح خمسمائة و ثلاثة و أربعون ألف</p>
        <p>و 676 يصبح ستمائة و ستة و سبعون</p>
        <p>ف 543676 تكتب <span class="important">خمسمائة و ثلاثة و أربعون ألف و ستمائة و ستة و سبعون</span></p>
        <p>الآن حل هذا السؤال:</p>
        <details>
            <summary>123765 اضغت علي السهم لإظهار الحل</summary>
            <p>تقسم الرقم إلي |765| و |123|</p>
            <p>ثم 123 يصبح مائة و ثلاثة و عشرون ألف</p>
            <p>و 765 يصبح سبعمائة و خمسة و ستون</p>
            <p>ف 123765 تكتب <span class="important">مائة و ثلاثة و عشرون ألف و سبعمائة و خمسة و ستون</span></p>
        </details>
        <p><span class="important">ما سبق كان طريقة أخري للحل, فالحساب يحتاج للذكاء و ليس الحفظ يا ذكي</span></p>
        <img src="الوسائط/الصور/مراجعة القيم.jpg" alt="كيف تجد القيمة المكانية و القيمة للأرقام" class="large-img">
        <p>هل تتذكر كيف تجد القيمة المكانية و القيمة للأرقام؟</p>
        <p>القيمة المكانية هي مكان الرقم في الرقم كله</p>
        <p>مثال: في 5432</p>
        <ul>
            <li>2 في خانة الآحاد</li>
            <li>3 في خانة العشرات</li>
            <li>4 في خانة المئات</li>
            <li>5 في خانة الألاف</li>
        </ul>
        <p>أما القيمة فهي قيمة الرقم نفسه</p>
        <p>مثال: في 5432</p>
        <ul>
            <li>2 قيمته 2</li>
            <li>3 قيمته 30</li>
            <li>4 قيمته 400</li>
            <li>5 قيمته 5000</li>
        </ul>
        <p>الآن حل هذا السؤال:</p>
        <details>
            <summary>القيمة المكانية ل7 في 375345</summary>
            <p>7 في خانة الألاف</p>
        </details>
        <details>
            <summary>القيمة ل4 في 375345</summary>
            <p>4 قيمته 40</p>
        </details>
        <img src="الوسائط/الصور/ترتيب الأرقام.jpg" alt="ترتيب الأرقام من الأصغر إلي الأكبر و العكس" class="large-img">
        <p>هذه المعلومة جديدة لكن سهلة</p>
        <p>ترتيب الأرقام تصاعدي و تنازلي</p>
        <p>تصاعدي يعني من الأصغر إلي الأكبر</p>
        <p>تنازلي يعني من الأكبر إلي الأصغر</p>
        <p>مثال: رتب الأرقام التالية تصاعدي و تنازلي</p>
        <ul>
            <li>345, 123, 567, 234</li>
        </ul>
        <details>
            <summary>الحل</summary>
            <p>تصاعدي: 123, 234, 345, 567</p>
            <p>تنازلي: 567, 345, 234, 123</p>
        </details>
        <p><span class="important">الملاحظة</span> أن التصاعدي هو التنازلي بالمقلوب</p>
        <p>سؤال آخر</p>
        <ul>
            <li>464536 , 534636 , 523675 , 546745 , 346435</li>
        </ul>
        <details>
            <summary>الحل</summary>
            <p>تصاعدي: 346435 , 464536 , 523675 , 534636 , 546745</p>
            <p>لأن:  346435 &lt; 464536 &lt; 523675 &lt; 534636 &lt; 546745</p>
            <p>تنازلي: 546745 , 534636 , 523675 , 464536 , 346435</p>
            <p>لأن: 546745 &gt; 534636 &gt; 523675 &gt; 464536 &gt; 346435</p>
        </details>
            <h2>الآن الامتحان: اضغت علي الزر لتبدأ</h2>
            <button onclick="startTest()" id="test1-btn">ابدأ الامتحان</button>`;
}

// level 2 below
function level2Chapter1Content(){
    return '5';
}


function level2Chapter2Content(){
    return '6';
}


function level2Chapter3Content(){
    return '7';
}


function level2Chapter4Content(){
    return '8';
}
// end of content functions
// functions
// Level 1 Chapter 1 functions
function checkAnswer1(){
    const userAnswer = document.getElementById("answer-input-1");
    const result = document.getElementById("result-1");
    const question = document.getElementById("question-1");
    answer = "";
    loopCounter = 0;
    while(loopCounter < question.textContent){
        answer += "O";
        loopCounter++;
    }
    if(userAnswer.value.toUpperCase() == answer){
        result.style.color = "green";
        result.textContent = "صحيح";
        trueSound.play();
    } else {
        result.textContent = "خطأ";
        result.style.color = "red";
        falseSound.play();
        
    }
    question.innerHTML = `${Math.floor(Math.random() * 10) + 1}`;
    userAnswer.value = "";
}
//level 1 Chapter 2 functions
function compare(userInput) {
    const number1 = parseInt(document.getElementById("question-machine-2-number-1").textContent);
    const number2 = parseInt(document.getElementById("question-machine-2-number-2").textContent);
    const result = document.getElementById("result2");
    
    if (userInput === "<") {
        if (number1 < number2) {
            result.textContent = "صحيح!";
            result.style.color = "green";
            trueSound.play();
            
        } else {
            result.textContent = "خطأ";
            result.style.color = "red";
            falseSound.play();
        }
    } else if (userInput === "=") {
        if (number1 === number2) {
            result.textContent = "صحيح!";
            result.style.color = "green";
            trueSound.play();
        } else {
            result.textContent = "حطأ!";
            result.style.color = "red";
            falseSound.play();
        }
    } else if (userInput === ">") {
        if (number1 > number2) {
            result.textContent = "صحيح";
            result.style.color = "green";
            trueSound.play();
        } else {
            result.textContent = "خطأ";
            result.style.color = "red";
            falseSound.play();
        }
    } else {
        result.textContent = "Invalid input!";
        result.style.color = "red";
    }
    // Reset the numbers for the next comparison
    document.getElementById("question-machine-2-number-1").textContent = Math.floor(Math.random() * 100) + 1;
    document.getElementById("question-machine-2-number-2").textContent = Math.floor(Math.random() * 100) + 1;
}
// lvl 1 chapter 4 functions
function answerQuestion4(userAnswer){
    const userAnswer1 = document.getElementById("question-machine-4-btn-1");
    const userAnswer2 = document.getElementById("question-machine-4-btn-2");
    const userAnswer3 = document.getElementById("question-machine-4-btn-3");
    const userAnswer4 = document.getElementById("question-machine-4-btn-4");
    const userAnswer5 = document.getElementById("question-machine-4-btn-5");
    const userAnswer6 = document.getElementById("question-machine-4-btn-6");
    const question = document.getElementById("question-4"); // الرقم كامل
    const question2 = document.getElementById("question-4-2");
    const result = document.getElementById("result4");
    let zeros = 0;
    let answer;
    let newNumber = '';
    newNumber += String(Math.ceil(Math.random()*9));
    for(const i of question.textContent.split('').reverse().join('')){
        if(i === question2.textContent){
            break;
        }
        zeros++;
    }
    if(userAnswer === zeros){
        result.textContent = 'صحيح!';
        result.style.color = 'green';
        trueSound.play();
    }else{
        result.textContent = 'خطأ!';
        result.style.color = 'red';
        falseSound.play();
    }
    let newNumberSize = Math.ceil(Math.random()*6);
    while(newNumber.length < newNumberSize){
        let number = String(Math.floor(Math.random()*10));
        if(!newNumber.includes(number)){
            newNumber += number;
        }

    }
    let newQuestionNumber = String(Math.ceil(Math.random()*9));
    while(!newNumber.includes(newQuestionNumber)){
        newQuestionNumber = String(Math.ceil(Math.random()*9));
    }
    userAnswer1.textContent = `${newQuestionNumber}`;
    userAnswer2.textContent = `${newQuestionNumber}0`;
    userAnswer3.textContent = `${newQuestionNumber}00`;
    userAnswer4.textContent = `${newQuestionNumber}000`;
    userAnswer5.textContent = `${newQuestionNumber}0000`;
    userAnswer6.textContent = `${newQuestionNumber}00000`;
    question2.textContent = newQuestionNumber;
    question.textContent = newNumber;
}
// level 1 chapter 5 functions
function startTest(){
    clickSound.play();
    document.getElementById('test1-modal').style.display = 'flex';
}
function submitTest1(){
    let score = 0;
    const answer1 = document.querySelector('input[name="q1"]:checked');
    const answer2 = document.querySelector('input[name="q2"]:checked');
    const answer3 = document.querySelector('input[name="q3"]:checked');
    const answer4 = document.querySelector('input[name="q4"]:checked');
    const answer5 = document.querySelector('input[name="q5"]:checked');
    const answer6 = document.querySelector('input[name="q6"]:checked');
    const answer7 = document.querySelector('input[name="q7"]:checked');
    const answer8 = document.querySelector('input[name="q8"]:checked');
    const answer9 = document.querySelector('input[name="q9"]:checked');
    const answer10part1 = document.getElementById('q10-answer1');
    const answer10part2 = document.getElementById('q10-answer2');
    const answer10part3 = document.getElementById('q10-answer3');
    if(answer1 && answer1.value === 'c'){
        score++;
    }
    if(answer2 && answer2.value === 'b'){
        score++;
    }
    if(answer3 && answer3.value === 'b'){
        score++;
    }
    if(answer4 && answer4.value === 'c'){
        score++;
    }
    if(answer5 && answer5.value === 'a'){
        score++;
    }
    if(answer6 && answer6.value === 'b'){
        score++;
    }
    if(answer7 && answer7.value === 'c'){
        score++;
    }
    if(answer8 && answer8.value === 'c'){
        score++;
    }
    if(answer9 && answer9.value === 'a'){
        score++;
    }
    if(answer10part1.value.replace('\s', '') > 6546 && answer10part2.value.replace('\s', '') < 6546 && answer10part3.value.replace('\s', '') == 6546){
        score++;
    }
    if(score === 10){
        document.getElementById('test1-modal-content').innerHTML = `<h1>نتيجتك: ${score}/10</h1><p>ممتاز! لقد حصلت علي الدرجة النهائية ${score}/10 🏆🏅🎉</p>`;
        trueSound.play();
    } else if(score >= 7){
        document.getElementById('test1-modal-content').innerHTML = `<h1>نتيجتك: ${score}/10</h1><p>جيد جداً!تم اجتياز الاختبار لقد حصلت علي درجة ${score}/10 🎉</p>`;
        clickSound.play();
    } else {
        document.getElementById('test1-modal-content').innerHTML = `<h1>نتيجتك: ${score}/10</h1><p>لم تجتز الاختبار. لا تقلق، حاول مرة أخرى وستتحسن بالتأكيد!</p>`;
        falseSound.play();
    }
    document.getElementById('test1-modal-content').innerHTML += `<button onclick='closeTest1Modal()' class='test1-closebtn'>اغلاق</button>`;
}
closeTest1Modal = () => {
    clickSound.play();
    document.getElementById('test1-modal').style.display = 'none';
    location.reload();
}
// Functions
function signUp() {
  const email = document.getElementById("email").value;
  const password = document.getElementById("password").value;

  firebase.auth()
    .createUserWithEmailAndPassword(email, password)
    .then(async (cred) => {
      authHeader.textContent = 'تسجيل الدخول/انشاء حساب من خلال البريد الاكتروني';
      const uid = cred.user.uid;

      await firebase.firestore()
        .collection("users")
        .doc(uid)
        .set({
          "الدور": "مستخدم",
          "المستوي": 1,
         "البريد الاكتروني": email,
          uid: uid,
          "محظور": false,
         "تاريخ الإنشاء": firebase.firestore.FieldValue.serverTimestamp()
        });

      console.log("Signup successful:", uid);
    })
    .catch((error) => {
      console.error("Signup error:", error.message);
    });
}


function signIn() {
  const email = document.getElementById("email").value;
  const password = document.getElementById("password").value;
  
  firebase.auth().signInWithEmailAndPassword(email, password)
    .then(async (cred) => {
      console.log("✅ Signed in:", cred.user.uid);

      // 🔍 check role
      const snap = await firebase.firestore()
        .collection("users")
        .doc(cred.user.uid)
        .get();

      const role = snap.data()["الدور"];

      console.log("👤 Role:", role);
        document.getElementById("password").value ='';
        document.getElementById("email").value = '';
      if (role === "مدير النظام") {
        console.log("🟢 مدير النظام قام بتسجيل الدخول");
        // show admin UI / redirect
        document.body.classList.add("admin");
      } else {
        console.log("🔵 مستخدم قام بتسجيل الدخول");
        // normal user UI
        document.body.classList.remove("admin");
      }
    })
    .catch((err) => {
      console.error("❌ Login error:", err.message);
    });
}





firebase.auth().onAuthStateChanged(async (user) => {
  if (!user) return;

  const snap = await firebase.firestore()
    .collection("users")
    .doc(user.uid)
    .get();

  if (!snap.exists) return;
  
  const role = snap.data()["الدور"];
  const isBanned = snap.data()["محظور"];
  if (isBanned){
    authHeader.textContent = 'تم حظرك للأسف, لن تستطيع تسجيل الدخول';
    authHeader.style.color = 'red';
    return;
  }
  const toggleBtn = document.getElementById("adminToggleBtn");
  const modal = document.getElementById("adminModal");
  const closeBtn = document.getElementById("closeAdminModal");
  const banBtn = document.getElementById("ban-btn");
  const unBanBtn = document.getElementById("unban-btn");
  mainScreen.style.display = 'block';
  loginScreen.style.display = 'none';
  console.log(role);
  document.getElementById('uid').textContent = user.uid;
  document.getElementById('lvl').textContent = snap.data()["المستوي"];
toggleBtn.addEventListener("click", () => {
      modal.style.display = "none";
    });
  // Only admins see the toggle button
  if (role === "مدير النظام") {
    toggleBtn.style.display = "inline-block";
    toggleBtn.addEventListener("click", () => {
      modal.style.display =
        modal.style.display === "flex" ? "none" : "flex";
    });
    
    closeBtn.addEventListener("click", () => {
      modal.style.display = "none";
    });
    banBtn.addEventListener("click", ()=>{
        const targetUid = document.getElementById("ban-by-id").value;
        banUser(targetUid);
    })
    unBanBtn.addEventListener("click", ()=>{
        const targetUid = document.getElementById("ban-by-id").value;
        unBanUser(targetUid);
    })
  } else {
    toggleBtn.style.display = "none";
  }
});


function banUser(targetUid) {
    const adminErrors = document.getElementById('admin-errors');
    console.log(adminErrors);
    if (targetUid.replace(/\s/,'') === ''){
        return adminErrors.textContent = 'القيمة غير صالحة';
    } 
    firebase.firestore()
    .collection("users")
    .doc(targetUid)
    .get()
    .then((snap)=>{
        if(!snap.exists){
            return adminErrors.textContent = 'ID غير موجود';
        }
    })
    firebase.firestore()
    .collection("users")
    .doc(targetUid)
    .update({ "محظور": true });
    adminErrors.textContent = '';
}
function unBanUser(targetUid) {
    const adminErrors = document.getElementById('admin-errors');
    if (targetUid.replace(/\s/,'') === ''){
        return adminErrors.textContent = 'القيمة غير صالحة';
    } 
    firebase.firestore()
    .collection("users")
    .doc(targetUid)
    .get()
    .then((snap)=>{
        if(!snap.exists){
            return adminErrors.textContent = 'ID غير موجود';
        }
        
    }).catch((err)=>{console.log(err)});
    firebase.firestore()
    .collection("users")
    .doc(targetUid)
    .update({ "محظور": false });
    adminErrors.textContent = '';
}
function signOut(){
    firebase.auth().signOut();
    console.log('logged out');
    document.getElementById("adminModal").style.display = "none";
    document.getElementById('main-container').style.display = 'none';
    document.getElementById('auth').style.display = 'flex';
    document.getElementById('adminToggleBtn').style.display = 'none';
    
};
